/* $ObjectName=MAFLogonManagerNG_iOS_iPad */
/* $Collection=frwk.tools.ios */
/* $Domain=BC */
/* $Developer=I043975 */
/* $Description=Mobile Application Framework - iOS Reusable Tool Components */

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidParameter" = "พารามิเตอร์ไม่ถูกต้อง";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "รหัสดำเนินการไม่ถูกต้อง";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "ไม่สามารถเชื่อมต่อไปยังเซิร์ฟเวอร์ กรุณาตรวจสอบข้อมูลการเข้าสู่ระบบ";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "ไม่สามารถรีเซ็ตแอพ กรุณาตรวจสอบว่าคุณมีการเชื่อมต่อไปยังเครือข่ายหรือไม่";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "ผู้ใช้เข้าสู่ระบบแล้ว";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "ระบบกำลังทำการดำเนินการ";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "เนื้อหาการดำเนินการไม่ถูกต้อง";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "ID สำหรับโปรโตคอลการติดต่อสื่อสารไม่ถูกต้อง";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "ID รายการการปฏิบัติไม่ถูกต้อง";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "ไม่สามารถกำหนดโปรโตคอลการติดต่อสื่อสาร";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "ไม่สามารถดึงคีย์สำหรับใบรับรอง";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "ไม่สามารถดึงใบรับรอง";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "ข้อผิดพลาดที่ไม่รู้จัก";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "มีที่เก็บที่ปลอดภัยแล้ว";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "ข้อผิดพลาดของประเภทข้อมูล";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "ไม่มีที่เก็บที่ปลอดภัย";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "อาร์กิวเมนต์ไม่ถูกต้อง";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "ป้อนรหัสผ่านอุปกรณ์ที่ถูกต้อง";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "ตรวจสอบรหัสผ่านของคุณ";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "ที่เก็บที่ปลอดภัยถูกล็อค";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "ที่เก็บที่ปลอดภัยมีหน่วยความจำไม่เพียงพอ";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "รหัสผ่านอุปกรณ์หมดอายุแล้ว คุณต้องเปลี่ยนแปลงรหัสผ่าน";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "ป้อนรหัสผ่านอุปกรณ์ซึ่งมีอักขระที่ไม่ซ้ำกันอย่างน้อย {0} ตัว";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "ป้อนรหัสผ่านอุปกรณ์ที่มีตัวเลขอย่างน้อยหนึ่งตัว";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอักขระตัวพิมพ์เล็กอย่างน้อยหนึ่งตัว";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอักขระพิเศษอย่างน้อยหนึ่งตัว";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "อุปกรณ์นี้ถูกลงทะเบียนสำหรับผู้ใช้อื่นแล้ว";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอักขระตัวพิมพ์ใหญ่อย่างน้อยหนึ่งตัว";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอย่างน้อย {0} อักขระ";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "ป้อนรหัสผ่านอุปกรณ์ซึ่งมีอักขระที่ไม่ซ้ำกันอย่างน้อย {0} ตัว";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "รหัสผ่านอุปกรณ์ที่คุณป้อนไม่ตรงกัน";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "ไม่อนุญาตให้ดำเนินการในสถานะนี้";

/* XMSG: message max. 60 chars */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "ข้อมูลการเข้าสู่ระบบที่คุณป้อนไม่เพียงพอหรือไม่ถูกต้อง กรุณาลองอีกครั้ง";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorCheckLoginData" = "ไม่สามารถเชื่อมต่อไปยังเซิร์ฟเวอร์ กรุณาตรวจสอบข้อมูลการเข้าสู่ระบบ";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "ตรวจสอบชื่อผู้ใช้และรหัสผ่านของคุณ";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "ไม่สามารถเชื่อมต่อไปยังเซิร์ฟเวอร์ กรุณาติดต่อผู้ดูแลระบบ";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "ข้อมูลการเข้าสู่ระบบที่คุณป้อนไม่เพียงพอหรือไม่ถูกต้อง กรุณาลองอีกครั้ง";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "ป้อนรหัสผ่านอุปกรณ์ที่ถูกต้อง";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "ป้อนรหัสผ่านอุปกรณ์ที่มีตัวเลขอย่างน้อยหนึ่งตัว";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "รหัสผ่านอุปกรณ์ที่คุณป้อนไม่ตรงกัน";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "รหัสผ่านอุปกรณ์หมดอายุแล้ว คุณต้องเปลี่ยนแปลงรหัสผ่าน";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeLength" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอย่างน้อย {0} อักขระ";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "ป้อนรหัสผ่านที่มีอักขระตัวพิมพ์เล็กอย่างน้อยหนึ่งตัว";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอักขระพิเศษอย่างน้อยหนึ่งตัว";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "ป้อนรหัสผ่านอุปกรณ์ซึ่งมีอักขระที่ไม่ซ้ำกันอย่างน้อย {0} ตัว";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอักขระตัวพิมพ์ใหญ่อย่างน้อยหนึ่งตัว";

/* XMSG max. 100 chars */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "ที่เก็บที่ปลอดภัยถูกลบ";

/* XMSG max. 100 chars */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "การดำเนินการไม่ได้รับการสนับสนุน";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "รหัสผ่าน SSO ไม่ถูกต้อง";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "ข้อมูลประจำตัวสำหรับ Afaria ไม่ถูกต้อง";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorClientIdentityNotFound" = "ไม่พบข้อมูลประจำตัวของไคลเอนท์";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorURLValidationFailed" = "การเข้าถึงถูกปฏิเสธ";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorAppSettingsValidation" = "Application Setting property validation failed for key:";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorXMLParserInitializationError" = "Cannot instantiate the xml parser.";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorXMLParserError" = "Error during xml parsing.";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorSettingsDownloadFailed" = "Settings download failed.";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorHTTPDomainError" = "HTTP domain error with response status:";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorInvalidJSONData" = "JSON data is invalid";

/* XMSG max 100 chars */
"keyErrDescrMAFLogonErrorJSONParserError" = "Error during json parsing";

